### Terraform `plan` Succeeded for Workspace: `default`
<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.logs will be created
+   resource "aws_cloudwatch_log_group" "logs" {
+       arn               = (known after apply)
+       id                = (known after apply)
+       name              = "apigateway-logs"
+       name_prefix       = (known after apply)
+       retention_in_days = 0
+       skip_destroy      = false
+       tags_all          = (known after apply)
    }

  # module.api_gateway["arn:aws:lambda:us-east-1:350131064538:function:cataprato"].aws_apigatewayv2_api.this[0] will be created
+   resource "aws_apigatewayv2_api" "this" {
+       api_endpoint                 = (known after apply)
+       api_key_selection_expression = "$request.header.x-api-key"
+       arn                          = (known after apply)
+       description                  = "My awesome HTTP API Gateway"
+       disable_execute_api_endpoint = false
+       execution_arn                = (known after apply)
+       id                           = (known after apply)
+       name                         = "cataprato-http"
+       protocol_type                = "HTTP"
+       route_selection_expression   = "$request.method $request.path"
+       tags_all                     = (known after apply)

+       cors_configuration {
+           allow_headers = [
+               "authorization",
+               "content-type",
+               "x-amz-date",
+               "x-amz-security-token",
+               "x-amz-user-agent",
+               "x-api-key",
            ]
+           allow_methods = [
+               "*",
            ]
+           allow_origins = [
+               "*",
            ]
        }
    }

  # module.api_gateway["arn:aws:lambda:us-east-1:350131064538:function:cataprato"].aws_apigatewayv2_integration.this["$default"] will be created
+   resource "aws_apigatewayv2_integration" "this" {
+       api_id                                    = (known after apply)
+       connection_type                           = "INTERNET"
+       id                                        = (known after apply)
+       integration_method                        = "POST"
+       integration_response_selection_expression = (known after apply)
+       integration_type                          = "AWS_PROXY"
+       integration_uri                           = "arn:aws:lambda:us-east-1:350131064538:function:cataprato"
+       payload_format_version                    = "1.0"
+       timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway["arn:aws:lambda:us-east-1:350131064538:function:cataprato"].aws_apigatewayv2_route.this["$default"] will be created
+   resource "aws_apigatewayv2_route" "this" {
+       api_id             = (known after apply)
+       api_key_required   = false
+       authorization_type = "NONE"
+       id                 = (known after apply)
+       route_key          = "$default"
+       target             = (known after apply)
    }

  # module.api_gateway["arn:aws:lambda:us-east-1:350131064538:function:cataprato"].aws_apigatewayv2_stage.default[0] will be created
+   resource "aws_apigatewayv2_stage" "default" {
+       api_id        = (known after apply)
+       arn           = (known after apply)
+       auto_deploy   = true
+       deployment_id = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       name          = "$default"
+       tags_all      = (known after apply)
    }

  # module.api_gateway["arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda"].aws_apigatewayv2_api.this[0] will be created
+   resource "aws_apigatewayv2_api" "this" {
+       api_endpoint                 = (known after apply)
+       api_key_selection_expression = "$request.header.x-api-key"
+       arn                          = (known after apply)
+       description                  = "My awesome HTTP API Gateway"
+       disable_execute_api_endpoint = false
+       execution_arn                = (known after apply)
+       id                           = (known after apply)
+       name                         = "cataprato-http"
+       protocol_type                = "HTTP"
+       route_selection_expression   = "$request.method $request.path"
+       tags_all                     = (known after apply)

+       cors_configuration {
+           allow_headers = [
+               "authorization",
+               "content-type",
+               "x-amz-date",
+               "x-amz-security-token",
+               "x-amz-user-agent",
+               "x-api-key",
            ]
+           allow_methods = [
+               "*",
            ]
+           allow_origins = [
+               "*",
            ]
        }
    }

  # module.api_gateway["arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda"].aws_apigatewayv2_integration.this["$default"] will be created
+   resource "aws_apigatewayv2_integration" "this" {
+       api_id                                    = (known after apply)
+       connection_type                           = "INTERNET"
+       id                                        = (known after apply)
+       integration_method                        = "POST"
+       integration_response_selection_expression = (known after apply)
+       integration_type                          = "AWS_PROXY"
+       integration_uri                           = "arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda"
+       payload_format_version                    = "1.0"
+       timeout_milliseconds                      = (known after apply)
    }

  # module.api_gateway["arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda"].aws_apigatewayv2_route.this["$default"] will be created
+   resource "aws_apigatewayv2_route" "this" {
+       api_id             = (known after apply)
+       api_key_required   = false
+       authorization_type = "NONE"
+       id                 = (known after apply)
+       route_key          = "$default"
+       target             = (known after apply)
    }

  # module.api_gateway["arn:aws:lambda:us-east-1:350131064538:function:cataprato-auth-lambda"].aws_apigatewayv2_stage.default[0] will be created
+   resource "aws_apigatewayv2_stage" "default" {
+       api_id        = (known after apply)
+       arn           = (known after apply)
+       auto_deploy   = true
+       deployment_id = (known after apply)
+       execution_arn = (known after apply)
+       id            = (known after apply)
+       invoke_url    = (known after apply)
+       name          = "$default"
+       tags_all      = (known after apply)
    }

Plan: 9 to add, 0 to change, 0 to destroy.
```
</details>